exempleMigrationCORAIL/services/mvtcrl_maestro/mvtcrls_maestro_tmp.dat

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope" xmlns:str="http://xml.inetpsa.com/Structure/Informatique/DeveloppementSI/ReferentielEchange" xmlns:pxd="http://xml.inetpsa.com/Fabrication/FluxConstituant/Messages/PrixDepart" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:odt="http://www.odette.org/core" xsi:schemaLocation="http://xml.inetpsa.com/Structure/Informatique/DeveloppementSI/ReferentielEchange../../MessageDepartCRL.xsd"><SOAP-ENV:Header><str:Flow><str:MessageID>414D5120474558454149424B50415330561262082E1CE601</str:MessageID><str:From>GEFCO</str:From><str:To>MAESTRO</str:To><str:TimeStamp>2015-11-20T11:47:24</str:TimeStamp></str:Flow></SOAP-ENV:Header><SOAP-ENV:Body><str:Action><str:Do>Insert</str:Do><str:Parameters><pxd:MilestoneInfo><pxd:Ship-fromPartyID>45686H  12</pxd:Ship-fromPartyID><pxd:NetShipmentDate>2015-11-20T11:45:00</pxd:NetShipmentDate><pxd:SupplierID>57572C  02</pxd:SupplierID><pxd:CustomerSGR>851</pxd:CustomerSGR><pxd:DeliveryDate>2015-11-24T10:30:00</pxd:DeliveryDate><pxd:PlatformID>85 01</pxd:PlatformID><pxd:TowID>R5348BBN</pxd:TowID></pxd:MilestoneInfo><pxd:DeliveryList><pxd:TrackID>C36085*00103D5</pxd:TrackID><pxd:CarriageOrderID>P09732112</pxd:CarriageOrderID><pxd:DeliveryFullID><pxd:DeliveryID>43853621</pxd:DeliveryID><pxd:UmShipmentID>0</pxd:UmShipmentID><pxd:UmCrlID>0</pxd:UmCrlID></pxd:DeliveryFullID></pxd:DeliveryList></str:Parameters></str:Action></SOAP-ENV:Body></SOAP-ENV:Envelope>
